[
  {
    "title": "My Journey in Technology",
    "date": "November 12, 2024",
    "filename": "20241112_233712_my_journey_in_technology.md",
    "content": "# My Journey in Technology\r\n\r\nIt’s funny how interests evolve into passions. I’ve always been fascinated by computers. One of my earliest memories is sitting on my dad’s lap, pretending to play *Doom* at the age of four. His interest in computers passed down to me, and by six or seven, I was helping build my first computer. I still remember the excitement (and relief) when it worked, despite my early mistake of skipping the motherboard standoffs. \r\n\r\n\r\n### A Growing Curiosity\r\nAs I grew, so did my curiosity about how computers worked. In high school, I attended a boarding school with a poorly managed network, which gave me endless opportunities to explore networking concepts. A computer science class in my sophomore year was pivotal; I would wake up in the middle of the night to jot down code ideas. This passion led to an acceptance into Wentworth for computer science, but I wasn’t ready for the academic track then.\r\n\r\n### Hands-On Work and Realizations\r\nInstead, I pursued woodworking and carpentry for several years. Eventually, I returned to college to earn a business degree with a minor in computer science. I found success in sales, handling everything from small businesses to boardrooms. Yet, despite the success, I realized that sales was just a job—not a passion.\r\n\r\n### Rediscovering Technology During Paternity Leave\r\nDuring my paternity leave for my first child, I began re-evaluating my career. I started exploring tech projects for fun, like setting up an Unraid server and expanding it into an advanced media hub, complete with networking upgrades and home automation. Every project felt like a return to my roots in technology, and I couldn't get enough.\r\n\r\n### A Turning Point\r\nThe birth of my daughter became a turning point. The joy I felt for her made me realize how little joy my job brought me. I wanted to set an example for her—showing her that passion can drive a fulfilling career. Since then, I’ve been learning nonstop, building enterprise-grade servers, experimenting with hypervisors, Kubernetes clusters, and diving into as much technology as I can.\r\n\r\n### Embracing My True Passion\r\nLooking back, this journey has shown me how powerful it is to pursue what you truly love. Now, I’m ready to turn my lifelong passion into a career in software and hardware, where I can bring the same level of excitement and curiosity I’ve had since the beginning.\r\n"
  }
]